# Running SQL from jupyter notebook

In [6]:
import pandas as pd
import sqlite3 as sql

In [2]:
df=pd.DataFrame({'name':['amruth','akshath','sharath','subu'],
                 'age':[23,34,32,23],
                 'city':['richardson','bangalore','tonoto','cali']
                
                })

In [3]:
df

      name  age        city
0   amruth   23  richardson
1  akshath   34   bangalore
2  sharath   32      tonoto
3     subu   23        cali

In [8]:
# connect to database
cnn=sql.connect('test.db')

In [9]:
df.to_sql('people',cnn)

4

In [10]:
# load the sql module to ipython
%load_ext sql

In [12]:
%sql sqlite:///test.db

In [13]:
%%sql 
select * from people

 * sqlite:///test.db
Done.

[(0, 'amruth', 23, 'richardson'),
 (1, 'akshath', 34, 'bangalore'),
 (2, 'sharath', 32, 'tonoto'),
 (3, 'subu', 23, 'cali')]

In [14]:
%%sql
select count(*) from people

 * sqlite:///test.db
Done.

[(4,)]

# example database filmlocations

In [15]:
cnn=sql.connect('filmLocation.db')

In [17]:
film_data=pd.read_csv('datasets/films.csv')
film_data.head(5)

,title,release_year,locations,fun_facts,production_company,distributor,director,writer,actor_1,actor_2,actor_3,state,city,point
0,Nash Bridges,2021,"Pier 45, San Francisco",NaN,"Village NB Productions, LLC",USA Nework,Greg Beeman,"Carlton Cuse, Bill Chais",Don Johnson,Cheech Marin,Joe Dinicol,CA,San Francisco,POINT (-122.417428501 37.809873676)
1,The OA Part II,2019,Ada Court at O'Farrell St,NaN,Lunar Mining LLC,Netflix,Zal Batmanglij,"Zal Batmanglij, Brit Marling",Brit Marling,Emory Cohen,Patrick Gibson,CA,San Francisco,POINT (-122.41568003 37.785469982)
2,"Looking ""Special""",2016,1246 Folsom Street,NaN,"Mission Street Productions, LLC",HBO,Andrew Haigh,Michael Lannan,Jonathan Groff,Frankie Alvarez,Murray Bartlett,CA,San Francisco,POINT (-122.411002006 37.774595007)
3,The Phone/Jexi,2019,Liberty St btwn Castro and Noe St,NaN,CBS Films Inc.,Lionsgate,"Jon Lucas, Scott Moore","Jon Lucas, Scott Moore",Adam Devine,Alexandra Shipp,Michael Pena,CA,San Francisco,POINT (-122.432399999 37.75702)
4,Terminator - Genisys,2015,California at Larkin,NaN,T5 Productions LLC,Paramount Pictures,Alan Taylor,James Cameron,Arnold Schwarzenegger,Jason Clarke,NaN,CA,San Francisco,POINT (-122.419039999 37.790790018)

In [18]:
film_data.to_sql('filmlocation',cnn)

2084

In [27]:
%sql sqlite:///filmLocation.db

In [31]:
df.to_sql('people',cnn)

4

In [34]:
%%sql
# select * from filmlocation

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
(sqlite3.OperationalError) unrecognized token: "#"
[SQL: # select * from filmlocation]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [56]:
%%sql
SELECT Title, Director, release_year,Writer FROM Filmlocation where release_year>2001 limit 5

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
Done.

[('Nash Bridges', 'Greg Beeman', 2021, 'Carlton Cuse, Bill Chais'),
 ('The OA Part II', 'Zal Batmanglij', 2019, 'Zal Batmanglij, Brit Marling'),
 ('Looking "Special"', 'Andrew Haigh', 2016, 'Michael Lannan'),
 ('The Phone/Jexi', 'Jon Lucas, Scott Moore', 2019, 'Jon Lucas, Scott Moore'),
 ('Terminator - Genisys', 'Alan Taylor', 2015, 'James Cameron')]

# Retrieve the fun facts and filming locations of all films.

In [55]:
%%sql
select fun_facts, locations from filmlocation limit 5

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
Done.

[(None, 'Pier 45, San Francisco'),
 (None, "Ada Court at O'Farrell St"),
 (None, '1246 Folsom Street'),
 (None, 'Liberty St btwn Castro and Noe St'),
 (None, 'California at Larkin')]

In [54]:
%%sql
SELECT Title,locations,release_year FROM filmlocation where release_year<=2000 limit 5

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
Done.

[('Dirty Harry', 'Portsmouth Square (Chinatown)', 1971),
 ('Harold and Maude', 'Sutro Baths (Point Lobos Avenue)', 1971),
 ('Time After Time', 'Palace of Fine Arts (3301 Lyon Street)', 1979),
 ('The Dead Pool', '550 El Camino Del Mar (Seacliff)', 1988),
 ('Junior', '722 Steiner Street', 1994)]

In [53]:
%%sql
select title,production_company, locations,release_year from filmlocation where writer <>'James Vameron' limit 5

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
Done.

[('Nash Bridges', 'Village NB Productions, LLC', 'Pier 45, San Francisco', 2021),
 ('The OA Part II', 'Lunar Mining LLC', "Ada Court at O'Farrell St", 2019),
 ('Looking "Special"', 'Mission Street Productions, LLC', '1246 Folsom Street', 2016),
 ('The Phone/Jexi', 'CBS Films Inc.', 'Liberty St btwn Castro and Noe St', 2019),
 ('Terminator - Genisys', 'T5 Productions LLC', 'California at Larkin', 2015)]

# Count, Distinct, Limit

In [48]:
%%sql
select count(locations) from filmlocation where writer ='James Cameron'

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
Done.

[(24,)]

In [52]:
%%sql
select distinct title from filmlocation limit 5

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
Done.

[('Nash Bridges',),
 ('The OA Part II',),
 ('Looking "Special"',),
 ('The Phone/Jexi',),
 ('Terminator - Genisys',)]

# Distinct

In [65]:
%%sql
select distinct release_year from filmlocation where production_company='Warner Bros. Pictures';
select count(distinct release_year) from filmlocation where production_company='Warner Bros. Pictures'

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
Done.
Done.

[(14,)]

# Limit

In [68]:
%%sql
select * from filmlocation limit 5 offset 10

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
Done.

[(10, 'Time After Time', 1979, 'Palace of Fine Arts (3301 Lyon Street)', 'The original Palace was built for the 1915 Panama-Pacific Exposition, and completely destroyed in 1964. It was rebuilt in 1965.', 'Orion Pictures Corp.', 'Columbia Broadcasting System (CBS)', 'Nicholas Meyer', 'Karl Alexander', 'Malcolm McDowell', 'Mary Steenburgen', 'David Warner', 'CA', 'San Francisco', 'POINT (-122.44899 37.80288)'),
 (11, 'Quitters', 2015, 'Claire Lilienthal Elementary School', None, 'Frederick & Ashbury, LLC.', None, 'Noah Pritzker', 'Noah Pritzker', 'Kara Hayward', 'Mira Sorvino', 'Saffron Burrows', 'CA', 'San Francisco', 'POINT (-122.45796 37.7871)'),
 (12, 'Quitters', 2015, '1536 Noe St.', None, 'Frederick & Ashbury, LLC.', None, 'Noah Pritzker', 'Noah Pritzker', 'Kara Hayward', 'Mira Sorvino', 'Saffron Burrows', 'CA', 'San Francisco', 'POINT (-122.431454017 37.744473004)'),
 (13, 'The Dead Pool', 1988, '550 El Camino Del Mar (Seacliff)', None, 'Warner Bros. Pictures', 'Warner Bros. Pictures', 'Buddy Van Horn', 'Harry Julian Fink', 'Clint Eastwood', 'Liam Neeson', 'Patricia Clarkson', 'CA', 'San Francisco', 'POINT (-122.489937992 37.787534989)'),
 (14, 'The Princess Diaries', 2001, '2601 Lyon Street', None, 'Walt Disney Pictures', 'Buena Vista Pictures', 'Garry Marshall', 'Gina Wendkos', 'Julie Andrews', 'Anne Hathway', None, 'CA', 'San Francisco', 'POINT (-122.447010997 37.794680981)')]

# Practice Exercises

In [72]:
%%sql
select count(locations) from filmlocation where director ='Woody Allen'

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
Done.

[(31,)]

In [74]:
%%sql
select count(title) from filmlocation where locations ='Russian Hill'

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
Done.

[(1,)]

In [77]:
%%sql
select count(*) from filmlocation where release_year<1950

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
Done.

[(31,)]

In [85]:
%%sql
select distinct (title),release_year from filmlocation where release_year>2000 limit 10

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
Done.

[('Nash Bridges', 2021),
 ('The OA Part II', 2019),
 ('Looking "Special"', 2016),
 ('The Phone/Jexi', 2019),
 ('Terminator - Genisys', 2015),
 ('Murder in the First, Season 3', 2016),
 ('Ant-Man and the Wasp', 2018),
 ('40 Days and 40 Nights', 2002),
 ('Quitters', 2015),
 ('The Princess Diaries', 2001)]

In [88]:
%%sql
select distinct title, director from filmlocation where locations='City Hall'

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
Done.

[('Tucker: The Man and His Dream', 'Francis Ford Coppola'),
 ('Jagged Edge', 'Richard Marquand'),
 ('Bedazzled', 'Harold Ramis'),
 ('Foul Play', 'Colin Higgins'),
 ('Milk', 'Gus Van Sant'),
 ('Final Analysis', 'Phil Joanou'),
 ('The Right Stuff', 'Philip Kaufman'),
 ('The Enforcer', 'James Fargo'),
 ('Class Action', 'Michael Apted'),
 ('Boys and Girls', 'Robert Iscove'),
 ('Knife Fight', 'Bill Guttentag'),
 ('Dawn of the Planet of the Apes', 'Matt Reeves'),
 ('A View to a Kill', 'John Glen'),
 ('Bicentennial Man', 'Chris Columbus'),
 ('180', 'Jayendra'),
 ('San Francisco', 'W.S. Van Dyke'),
 ('Smile Again, Jenny Lee', 'Carlo Caldana'),
 ('The Wedding Planner', 'Adam Shankman'),
 ('Magnum Force', 'Ted Post'),
 ('The Rock', 'Michael Bay'),
 ('When We Rise', 'Gus Van Sant'),
 ('Invasion of the Body Snatchers', 'Philip Kaufman')]

In [91]:
%%sql
select count(distinct distributor) from filmlocation where actor_1='Clint Eastwood'

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
Done.

[(3,)]

In [92]:
%%sql
SELECT DISTINCT Title FROM FilmLocations LIMIT 50

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
(sqlite3.OperationalError) no such table: FilmLocations
[SQL: SELECT DISTINCT Title FROM FilmLocations LIMIT 50]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [93]:
%%sql
SELECT DISTINCT Title FROM FilmLocations WHERE ReleaseYear=2015 LIMIT 10

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
(sqlite3.OperationalError) no such table: FilmLocations
[SQL: SELECT DISTINCT Title FROM FilmLocations WHERE ReleaseYear=2015 LIMIT 10]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [97]:
%%sql
select distinct title from filmlocation where release_year=2015 limit 3 offset 5

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
Done.

[('Looking Season 2 ep 204',), ('Summertime',), ('San Andreas',)]

In [140]:
data=pd.read_csv('datasets/instructors.csv',index_col='ins_id')
# data.reset_index(inplace=True)
data

         lastname firstname     city country
ins_id
1           Ahuja       Rav  Toronto      CA
2           Chong      Raul  Toronto      CA
3       Vasudevan      Hima  Chicago      US

In [141]:
data.to_sql('instructor',cnn)

3

# INSERT statement
- syntax:
INSERT INTO table_name (column1, column2, ... )
VALUES (value1, value2, ... )
;

In [142]:
%%sql
INSERT INTO Instructor(ins_id, lastname, firstname, city, country)
VALUES(4, 'Saha', 'Sandip', 'Edmonton', 'CA')

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
1 rows affected.

[]

In [143]:
%%sql
SELECT * FROM Instructor

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
Done.

[(1, 'Ahuja', 'Rav', 'Toronto', 'CA'),
 (2, 'Chong', 'Raul', 'Toronto', 'CA'),
 (3, 'Vasudevan', 'Hima', 'Chicago', 'US'),
 (4, 'Saha', 'Sandip', 'Edmonton', 'CA')]

In [145]:
%%sql
INSERT INTO Instructor(ins_id, lastname, firstname, city, country)
VALUES(5, 'Doe', 'John', 'Sydney', 'AU'), 
(6, 'Doe', 'Jane', 'Dhaka', 'BD');
select * from instructor

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
2 rows affected.
Done.

[(1, 'Ahuja', 'Rav', 'Toronto', 'CA'),
 (2, 'Chong', 'Raul', 'Toronto', 'CA'),
 (3, 'Vasudevan', 'Hima', 'Chicago', 'US'),
 (4, 'Saha', 'Sandip', 'Edmonton', 'CA'),
 (5, 'Doe', 'John', 'Sydney', 'AU'),
 (6, 'Doe', 'Jane', 'Dhaka', 'BD'),
 (5, 'Doe', 'John', 'Sydney', 'AU'),
 (6, 'Doe', 'Jane', 'Dhaka', 'BD')]

# Practice exercise

In [146]:
%%sql
insert into instructor
values (7,' Antonio','Cangiano','Vancouver','CA')

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
1 rows affected.

[]

In [149]:
%%sql
insert into instructor
values (8,' Steve','Ryan','Barlby','GB'),
(9,' Ramesh ','Sannareddy','Hyderabad','IN')

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
2 rows affected.

[]

In [150]:
%%sql
select * from instructor

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
Done.

[(1, 'Ahuja', 'Rav', 'Toronto', 'CA'),
 (2, 'Chong', 'Raul', 'Toronto', 'CA'),
 (3, 'Vasudevan', 'Hima', 'Chicago', 'US'),
 (4, 'Saha', 'Sandip', 'Edmonton', 'CA'),
 (5, 'Doe', 'John', 'Sydney', 'AU'),
 (6, 'Doe', 'Jane', 'Dhaka', 'BD'),
 (5, 'Doe', 'John', 'Sydney', 'AU'),
 (6, 'Doe', 'Jane', 'Dhaka', 'BD'),
 (7, ' Antonio', 'Cangiano', 'Vancouver', 'CA'),
 (8, ' Steve', 'Ryan', 'Barlby', 'GB'),
 (9, ' Ramesh ', 'Sannareddy', 'Hyderabad', 'IN')]

# UPDATE statement
- syntax : UPDATE table_name
SET column1 = value1, column2 = value2, ...
WHERE condition
;

In [151]:
%%sql

UPDATE Instructor 
SET city='Toronto' 
WHERE firstname="Sandip"

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
1 rows affected.

[]

In [152]:
%%sql
UPDATE Instructor 
SET city='Dubai', country='AE' 
WHERE ins_id=5

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
2 rows affected.

[]

# Practice exercise

In [153]:
%%sql
update instructor set city='Markham' where ins_id=1

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
1 rows affected.

[]

In [154]:
%%sql
update instructor set city='Dhaka', country='BD' where firstname='Sandip' and ins_id=4

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
1 rows affected.

[]

# DELETE statement 
- syntax: DELETE FROM table_name
WHERE condition
;

In [155]:
%%sql
DELETE FROM instructor
WHERE ins_id = 6

 * sqlite:///filmLocation.db
   sqlite:///filmlocation
   sqlite:///test.db
2 rows affected.

[]

In [ ]:
%%sql
delete from instrutor where firstname=''